#1.  Хранение текущего количества студентов в группе - int, т.к. это целое число
#2.  Хранение температуры в градусах Цельсия (например, 23.5) - float, т.к. это дробное значение
#3.  Хранение логина пользователя (например, "ivanov_ivan") - string, т.к. это буквенное значение
#4.  Хранение информации о том, включено ли уведомление (да/нет) - bool, т.к. тут есть только 2 варианта значений
#5.  Хранение списка любимых фильмов - list, т.к. в нём можно хранить большое количсетво различных значений и искать по номеру добавления
#6.  Хранение координат точки в 2D пространстве (x, y), которые не должны изменяться после задания - tuple, т.к. кортёж упорядочен и неизменяем
#7.  Хранение уникальных ID товаров в корзине покупок - set, т.к. все элементы в множестве уникальны
#8.  Хранение соответствия между названием страны и её столицей. - dict, т.к. список имеет уникальные ключи неизменяемого типа данных и значения к ним
