print("","‾"*45,"")
print(" ", " "*2,"Напиток 1 -    Кофе☕.   цена - 120 руб"," "," " )
print(" ", " "*2,"Напиток 2 -     Чай🍵.   цена -  80 руб"," "," " )
print(" ", " "*2,"Напиток 3 -     Сок🧃.   цена - 100 руб"," "," " )
print(" ", " "*2,"Напиток 4 -    Вода💧.   цена -  50 руб"," "," " )
print(" ", " "*2,"Напиток 5 - Лимонад🥤.   цена -  90 руб"," "," " )
print("","—"*45,"" )


product = input("Введите номер напитка или название: ")
kolichestvo = int(input("Введите количество порций: "))

COFFEE = 120
TEA = 80
SOK = 100
WATER = 50
LEMONADE = 90

match product:
    case "кофе"|"1":
        print("", "‾" * 45, "")
        print(" ", " " * 8, "☕КВИТАНЦИЯ ТОВАРА☕", " ", " ")
        print("", "‾" * 45, "")
        print("")
        print(f"")